#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_vpc.my_vpc: Refreshing state... [id=vpc-0e80586ce920b9fe9]
data.aws_ecr_repository.poetry-image-push: Reading...
data.aws_iam_policy_document.assume_role_policy: Reading...
aws_ecr_repository.poetry-image-push: Refreshing state... [id=poetry-app]
data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
aws_iam_role.testecsTaskExecutionRole: Refreshing state... [id=testecsTaskExecutionRole]
aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy: Refreshing state... [id=testecsTaskExecutionRole-20230804092053551600000001]
data.aws_ecr_repository.poetry-image-push: Read complete after 1s [id=tessian-demo-ramg]
aws_internet_gateway.gw: Refreshing state... [id=igw-07d0e0118354106ad]
aws_subnet.public: Refreshing state... [id=subnet-0b6bb74c1a27cc113]
aws_security_group.ecs_sg: Refreshing state... [id=sg-02fb7e43228a28a1d]
aws_route_table.main-route-table: Refreshing state... [id=rtb-00e49fc4eded95f08]
aws_route_table_association.route-table-association: Refreshing state... [id=rtbassoc-076a245abb3240290]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ecr_repository.poetry-image-push will be destroyed
  # (because aws_ecr_repository.poetry-image-push is not in configuration)
  - resource "aws_ecr_repository" "poetry-image-push" {
      - arn                  = "arn:aws:ecr:eu-west-2:180306264335:repository/poetry-app" -> null
      - id                   = "poetry-app" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "poetry-app" -> null
      - registry_id          = "180306264335" -> null
      - repository_url       = "180306264335.dkr.ecr.eu-west-2.amazonaws.com/poetry-app" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "ecs_cluster"
      + tags_all           = (known after apply)

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-02fb7e43228a28a1d",
            ]
          + subnets          = [
              + "subnet-0b6bb74c1a27cc113",
            ]
        }
    }

  # aws_ecs_task_definition.task_definition will be created
  + resource "aws_ecs_task_definition" "task_definition" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + image        = "180306264335.dkr.ecr.eu-west-2.amazonaws.com/tessian-demo-ramg"
                  + name         = "my-container"
                  + portMappings = [
                      + {
                          + containerPort = 8000
                          + hostPort      = 8000
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::180306264335:role/testecsTaskExecutionRole"
      + family                   = "task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @ramg777, Action: `pull_request`*